// effect
// 리액트의 컴포넌트들은 외부 시스템과 동기화가 필요한 경우가 있다.
//  -> 서버 연결 설정, 랜더링 후 분석결과를 보낼때, 그 외 데이터 비동기 로딩 시
//  -> 화면에 요소들 로딩( 랜더링)다 끝나고 실행할 내용들이 있다면 사용

// useEffect는 promise then메서드와도 비슷하다.

// 컴포넌트의 유형

// 랜더링코드 : 프로퍼티와 상태를 가져와 변환한 후에 화면에 표시할 내용을 리턴
//  -> JSX를 통해 화면에 표시할 내용을 리턴
//  -> 가장 좋은 랜더링 코드는 결과만 어떻게 보여줄건지만 고민( 결과 계산)
//     (단순히 결과만 보여준다해서 순수코드라고 부른다.)

// 이벤트 핸들러
// 어플리케이션에서 일어나는 이벤트를 제어하는 영역
// 컴포넌트 내부에 중첩되어 있는 함수들 -> 실질적 작업 수행의 영역
// 리액트의 이벤트 핸들러는 side effect를 포함( 프로그램의 상태를 변경)
//  -> 효과는 필요할 때 쓰는것이며 필수는 아니다.

// effect 